tutorials/combustion/fireFoam/les/smallPoolFire2D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.5 0 -0.01)
    ( 0.5 0 -0.01)
    ( 0.5 1 -0.01)
    (-0.5 1 -0.01)
    (-0.5 0  0.01)
    ( 0.5 0  0.01)
    ( 0.5 1  0.01)
    (-0.5 1  0.01)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (150 150 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch base
    (
        (0 1 5 4)
    )
    patch outlet
    (
        (3 2 6 7)
    )
    patch sides
    (
        (1 5 6 2)
        (0 4 7 3)
    )
    empty frontAndBack
    (
        (0 1 2 3)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
